#!/usr/bin/perl
################################################################################
# 
# システム名：横断集計
# 
# プログラム名：v_argsum.pl
#
# 機能概要：
#   引数で指定された値を全て加算する。
#
# 作成日：2014/12/10
#
# 作成者：K.Shimada
#
# 修正履歴：
#   yyyy/mm/dd K.Shimadaxxxxxx 
#     ＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮ
#     ＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮ
#
################################################################################
use strict;
use warnings;
use utf8;
use bignum;

die("引数には数値を設定してください\n") if @ARGV == 0;

my $rtn=0;

foreach my $val (@ARGV){
   $rtn += $val;
}
die("引数には数値を設定してください\n") if $rtn !~ /\d/;
print $rtn,"\n";


exit 0;
