#!/usr/bin/perl
################################################################################
# 
# システム名：横断集計
# 
# プログラム名：v_wc.pl
#
# 機能概要：
#   指定されたファイルの行数をカウントする。
#
#   ファイル数分wcコマンドの実行で行数を取得し、
#   結果のファイル名を除去し、標準出力に書きだす。
#
# 作成日：2014/12/10
#
# 作成者：K.Shimada
#
# 修正履歴：
#   yyyy/mm/dd K.Shimadaxxxxxx 
#     ＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮ
#     ＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮＮ
#
################################################################################
use strict;
use warnings;
use utf8;

my $ot_cnt=0;
print STDERR "[INFO]$0 start\n";

sub wc {
   #引数は必ず１ファイルだけ
   my $rtn = `wc -l @_`;
   if ( $? != 0){
       die("[ERROR]wcコマンド実行でエラー発生\n");
   }
   print $rtn=~/(\d+)/,"\n";   #左端の数値だけ取り出す
   $ot_cnt++;
}

#引数の数で、標準入力 or ファイル の切り替え
if ( @ARGV == 0 ){
  wc '-';
}else{
  #wcに複数ファイルを渡すと合計行が出力されてしまうので、１つづ実行
  foreach my $val (@ARGV){
    wc $val;
  }
}

print STDERR "[INFO]output=$ot_cnt\n";
print STDERR "[INFO]$0 normal end\n";

exit 0;
