/****************************************************************************/
/*	システム名称	：	ＤＩＳユーティリティー								*/
/*	ライブラリ名称	：	共通ライブラリ（libdistool.a）						*/
/*	関数名称		：	 1.マスタキー項目比較（cm_compare_master_key）		*/
/*	作成者			：	T.Akiyama (DIS)										*/
/*	作成日			：	2001/12/04											*/
/*	修正履歴		：														*/
/*	No.	修正日付	修正者			修正内容								*/
/*	001	    /  /  															*/
/****************************************************************************/

/*--------------------------------------------------------------------------*/
/*	ヘッダーファイルインクルード定義										*/
/*--------------------------------------------------------------------------*/
/*	System Headder File Include												*/
#include		<string.h>

/*	User Headder File Include												*/
#include		"libdistool.inc"

/*--------------------------------------------------------------------------*/
/*	外部グローバル変数参照定義												*/
/*--------------------------------------------------------------------------*/
extern	int		G_mstkeylen ;				/*	マスタキーレングス			*/

/****************************************************************************/
/*	関数名称：	cm_compare_master_key（マスタキー項目比較）					*/
/*	処理概要：	指定されたマスタキー項目をグローバル変数のマスタキー		*/
/*				レングスで比較し、比較結果を返す bsearch() 用比較関数。		*/
/*	入	力	：	key1：	マスタキー項目１									*/
/*	入	力	：	key2：	マスタキー項目２									*/
/*	戻り値	：	比較結果（0 ... 等しい、正 ... key1>key2、負 ... key1<key2）*/
/****************************************************************************/
int
cm_compare_master_key(const void *key1, const void *key2)
{

/*--------------------------------------------------------------------------*/

	/*	マスタキー項目をマスターキーレングス分比較し、比較結果を返却		*/
	return(memcmp(key1, key2, G_mstkeylen)) ;
}
/*** End Of File ***/

