/****************************************************************************/
/*	システム名称	：	ＤＩＳユーティリティー								*/
/*	ライブラリ名称	：	共通ライブラリ（libdistool.a）						*/
/*	関数名称		：	 1.エラーメッセージ取得（cm_get_errmsg）			*/
/*	作成者			：	T.Akiyama (DIS)										*/
/*	作成日			：	2001/12/03											*/
/*	修正履歴		：														*/
/*	No.	修正日付	修正者			修正内容								*/
/*	001	    /  /  															*/
/****************************************************************************/

/*--------------------------------------------------------------------------*/
/*	ヘッダーファイルインクルード定義										*/
/*--------------------------------------------------------------------------*/
/*	System Headder File Include												*/
#include		<string.h>
#include		<stdio.h>

/*	User Headder File Include												*/
#include		"libdistool.inc"

/****************************************************************************/
/*	関数名称：	cm_get_errmsg（エラーメッセージ取得）						*/
/*	処理概要：	引数で指定されたエラーＮｏに対応するエラーメッセージを		*/
/*				取得し、ポインタを返す。									*/
/*	入	力	：	errnum	：	エラーＮｏ										*/
/*	戻り値	：	エラーメッセージポインタ									*/
/****************************************************************************/
char
*cm_get_errmsg(int errnum)
{

	char			*emptr		;			/* エラーメッセージポインタ		*/
	static	char	errmsg[32]	;			/* エラーメッセージバッファ		*/

/*--------------------------------------------------------------------------*/

	/* 指定されたエラーＮｏに該当するエラーメッセージを取得					*/
	emptr = strerror(errnum) ;
	if(emptr == NULL){								/* 該当ｴﾗｰﾒｯｾｰｼﾞ無し	*/

		/* エラーＮｏ範囲外エラーメッセージを編集してリターン				*/
		(void)sprintf(errmsg, "errno[%d] is out-of-range", errnum) ;
		return(errmsg) ;
	}

	return(emptr) ;
}
/*** End Of File ***/

