------------------------------------------------------------------------
-- Shell-id      : shnad1111.csh
-- ファイル名    : hnm001.ctl
-- 機能          : HNM_メニュー情報 データローディング
-- 作成者        : M.Yamamoto
-- 作成日        : 2025/12/01
-- 修正履歴      :
-- Ｎｏ   修正日付   修正者     修正内容
--    1  xxxx/xx/xx  XXXXXXXXX  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
------------------------------------------------------------------------
------------------------------------------------------------------------
--      初期処理部
------------------------------------------------------------------------
LOAD DATA
REPLACE
PRESERVE BLANKS
INTO TABLE HNM_メニュー情報
FIELDS TERMINATED BY X'09'
-- OPTIONALLY ENCLOSED BY '"'
TRAILING NULLCOLS
(
    会社コード,
    現行メニュー連携フラグ,
    メニューＩＤ,
    有効開始日 "TO_DATE(:有効開始日,'YYYYMMDD')",
    有効終了日 "TO_DATE(:有効終了日,'YYYYMMDD')",
    メニュー単位連番,
    メニュー名,
    メニュー単位名,
    起動ＵＲＬ,
    サービス区分,
    更新系区分,
    異動後サービス許可日数,
    標準サービス開始時間,
    標準サービス終了時間,
    サービス開始変更時間,
    サービス終了変更時間,
    最早サービス時間,
    最遅サービス時間,
    月曜サービス開始時間,
    月曜サービス終了時間,
    火曜サービス開始時間,
    火曜サービス終了時間,
    水曜サービス開始時間,
    水曜サービス終了時間,
    木曜サービス開始時間,
    木曜サービス終了時間,
    金曜サービス開始時間,
    金曜サービス終了時間,
    土曜サービス開始時間,
    土曜サービス終了時間,
    日曜サービス開始時間,
    日曜サービス終了時間,
    備考１,
    備考２,
    備考３,
    登録日時 "TO_DATE(:登録日時,'YYYY/MM/DD HH24:MI:SS')",
    登録者氏名コード,
    最終更新日時 SYSDATE,
    最終更新者ＩＤ CONSTANT 'BATCH',
    有効フラグ CONSTANT '1',
    削除フラグ CONSTANT '0'
)

