create or replace package OHN001.hnadop900	as
/************************************************************************/
/*	ＰＧＭ名	：  セキュリティシステムリテラル定義					*/
/*	ＰＧＭ ｉｄ	：	hnadop900											*/
/*  機能		：	各種リテラル値を定義								*/
/*																		*/
/*	作成者		：	VINX												*/
/*	作成日		：	2025/11/28											*/
/************************************************************************/
	C_メニュー単位_START		HNM_メニュー情報.メニューＩＤ%type	:=	'START';
	C_セキュリティグループ区分	char(4)	:=	'0001';
	C_リテラル区分_init_pass	char(6)	:=	'000101';
	C_リテラル区分_着任日制御	char(6)	:=	'000102';
	C_CHK_00					char(2):=	'00';
	C_CHK_01					char(2):=	'01';
	C_CHK_02					char(2):=	'02';
	C_CHK_03					char(2):=	'02';
	C_CHK_04					char(2):=	'04';
	C_CHK_05					char(2):=	'05';
	C_CHK_06					char(2):=	'06';
	C_CHK_07					char(2):=	'07';
	C_CHK_08					char(2):=	'08';
	C_CHK_09					char(2):=	'09';
	C_CHK_10					char(2):=	'10';
	C_CHK_11					char(2):=	'11';
	C_CHK_12					char(2):=	'12';
	C_CHK_13					char(2):=	'13';
	C_CHK_14					char(2):=	'14';
	C_CHK_15					char(2):=	'15';
	C_CHK_16					char(2):=	'16';
	C_CHK_17					char(2):=	'17';
	C_CHK_18					char(2):=	'18';
	C_CHK_19					char(2):=	'19';
	C_本部取引区分_本部			char(1):=	'0';
	C_本部取引区分_取引先		char(1):=	'1';	
end	hnadop900;
/
