#!/bin/csh
#------------------------------------------------------------------------#
# ネット-名     : HNM_メニュー情報受信ファイル取出し＆ロード
# JOB-名        : 受信ファイル取出し(HNM_メニュー情報)
# Shell-名      : shnad1110.csh
# 機能          : １．ＪＯＢ出力ファイル削除
#               : ２．IFP集信ファイル取出し部
# 作成者        : M.Yamamoto
# 作成日        : 2025/12/01
# 修正履歴      : 
# Ｎｏ   修正日付   修正者     修正内容
#------------------------------------------------------------------------#
#------------------------------------------------------------------------#
#     ０． 初期処理部
#------------------------------------------------------------------------#
set SUBSRCDIR = "/prod/jcl/sub"
#----  ワークディレクトリの設定
source $SUBSRCDIR/hnad.src

#----  共通変数設定
source $SUBSRCDIR/common.src
if ( $status != $NORMAL ) then
  exit $ABEND
endif

#------------------------------------------------------------------------#
#      １．ＪＯＢ出力ファイル削除
#------------------------------------------------------------------------#
echo "rm -f $WKDIR/hnt401p_001.tsv" | tee -a $LOG_FILE
rm $WKDIR/hnt401p_001.tsv

#------------------------------------------------------------------------#
#     ２．IFP集信ファイル取出し部
#------------------------------------------------------------------------#
set BAKRECV_DIR = $BKUPDIR                     # 集信ファイルのバックアップ先
set F_FILE      = ${IFTYPE}HN-AD00-DZMENU      # 論理ファイル名
set D_FILE      = $WKDIR/hnt401p_001.tsv       # 取出し後ファイル名
#
set N_NO = 1 # 取出し件数　※省略時は1
set P_PROCEDURE = 1 # 処理区分　※省略時は1
                    #   1:ファイルがN_NO数到着する迄待ち、監視打ち切りは行わない
                    #   3:ファイルがN_NO数到着する迄待つが、監視回数で打切る。その時取出しファイルゼロバイト出力。
#set E_ERASE = -e # 取出し後ファイルの事前削除指定　※省略時は削除しない
#set SERCH_CNT = 10 # 監視回数　※処理区分=3の時必須指定
#set SERCH_INTERVAL = 60 # 監視間隔（秒）　※省略時は180秒
#
source $SUBSRCDIR/ifpRecv.src
if ( $status != $NORMAL )  then
    sync    #メモリとＤＩＳＫの同期化実施
    echo "$SHELLNAME:t :  ABEND time : `date +%y/%m/%d:%H:%M:%S`" | tee -a $LOG_FILE
    exit $ABEND
endif

#------------------------------------------------------------------------#
#   ファイル権限変更
#------------------------------------------------------------------------#
chmod 666 $WKDIR/hnt401p_001.tsv

#------------------------------------------------------------------------#
#      正常終了
#------------------------------------------------------------------------#
echo "$SHELLNAME:t :  end  time : `date +%y/%m/%d:%H:%M:%S`" | tee -a $LOG_FILE
exit $NORMAL

